
window.addEventListener("DOMContentLoaded", () => {
    setTimeout(() => {
        document.body.setAttribute("lang", "zh-CN");
        const customDict = [
            ["“", "「"],
            ["”", "」"],
            ["‘", "『"],
            ["’", "』"],
            ["內", "内"],
            ["佔", "占"],//
            ["吳", "呉"],
            ["巢", "巣"],
            ["徵", "徴"],
            ["戱", "戲"],//
            ["户", "戸"],
            ["揭", "掲"],
            ["擊", "撃"],
            ["晚", "晩"],
            ["曆", "暦"],
            ["查", "査"],
            ["步", "歩"],
            ["歲", "歳"],
            ["歷", "歴"],
            ["每", "毎"],
            ["污", "汚"],
            ["涉", "渉"],
            ["淚", "涙"],
            ["渴", "渇"],
            ["狀", "状"],
            ["產", "産"],
            ["絕", "絶"],
            ["緣", "縁"],
            ["腳", "脚"],
            ["虛", "虚"],
            ["眾", "衆"],
            ["鄉", "郷"],
            ["錄", "録"],
            ["鍊", "錬"],
            ["僱", "雇"],//
            ["雞", "鶏"],
            ["黃", "黄"],
            //一级字表
            ["勻", "匀"],
            ["兑", "兌"],
            ["灶", "竃"],
            ["卧", "臥"],
            ["剎", "刹"],
            ["潑", "溌"],
            ["荔", "茘"],
            ["鷗", "鴎"],
            ["啞", "唖"],
            ["萊", "莱"],
            ["繡", "繍"],
            ["貓", "猫"],
            ["禱", "祷"],
            ["搔", "掻"],
            ["焰", "焔"],
            ["榆", "楡"],
            ["蜕", "蛻"],
            ["醬", "醤"],
            ["痹", "痺"],
            ["鹼", "鹸"],
            ["蠟", "蝋"],
            ["瘦", "痩"],
            ["藴", "蘊"],
            ["鱉", "鼈"],
            //二级字表
            ["戾", "戻"],
            ["彥", "彦"],
            ["缽", "鉢"],
            ["摑", "掴"],
            ["媪", "媼"],
            ["贗", "贋"],
            //其他
            ["幫", "幇"],
            ["值", "値"],
            ["俱", "倶"],
            ["繫", "系"],
            //人名
            ["餘釗煥", "余釗煥"],
        ];
        const converter = OpenCC.ConverterFactory(
            OpenCC.Locale.from.cn,
            OpenCC.Locale.to.hk,
            [customDict]
        );
        const rootNode = document.documentElement;
        const HTMLConvertHandler = OpenCC.HTMLConverter(
            converter,
            rootNode,
            "zh-CN",
            "zh-HK"
        );
        HTMLConvertHandler.convert();
    }, 500);
});